app/views/employees/_form.html.erb

    <%= f.label :building_id , 'Unidad Recidencial' %>
    <%= f.collection_select(:building_id,Building.all,:id,:nombre_completo)%>
---
SELECT "buildings".* FROM "buildings"