app/views/buildings/show.html.erb

SELECT "employees".* FROM "employees" WHERE "employees"."building_id" = ?  [["building_id", 1]]
---
  <tbody>
    <% @building.employees.each do |empleado| %>