app/controllers/buildings_controller.rb

  def update
    respond_to do |format|
      if @building.update(building_params)
---
UPDATE "buildings" SET "nit" = ?, "nombre" = ?, "telefono" = ?, "direccion" = ?, "activo" = ?, "updated_at" = ? WHERE "buildings"."id" = ?  [["nit", "1123818238-1"], ["nombre", "Unidad 2"], ["telefono", "19283912"], ["direccion", "c1"], ["activo", true], ["updated_at", 2017-03-13 14:50:58 UTC], ["id", 1]]

    def set_building
      @building = Building.find(params[:id])
---
SELECT  "buildings".* FROM "buildings" WHERE "buildings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]