app/controllers/employees_controller.rb

SELECT  "buildings".* FROM "buildings" WHERE "buildings"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def index
    @building = Building.find params[:building_id]

SELECT  "buildings".* FROM "buildings" WHERE "buildings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "employees" ("cedula", "nombre", "direccion", "cargo", "email", "edad", "fehca_nacimiento", "building_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @building = Building.find params[:building_id]
    @employee = @building.employee.new(employee_params)

    respond_to do |format|
      if @employee.save

SELECT  "buildings".* FROM "buildings" WHERE "buildings"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "employees".* FROM "employees" WHERE "employees"."building_id" = ? AND "employees"."id" = ? LIMIT ?  [["building_id", 1], ["id", 2], ["LIMIT", 1]]
---
    def set_employee
      @building = Building.find params[:building_id]
      @employees = @building.employees.find(params[:id])